<center>
<img src="../../img/ods_stickers.jpg" />
    
## [mlcourse.ai](mlcourse.ai) â€“ Open Machine Learning Course 
Author: Arina Lopukhova (@erynn). Edited by [Yury Kashnitskiy](https://yorko.github.io) (@yorko). This material is subject to the terms and conditions of the [Creative Commons CC BY-NC-SA 4.0](https://creativecommons.org/licenses/by-nc-sa/4.0/) license. Free use is permitted for any non-commercial purpose.

<h1><center>Assignment #1. Fall 2018</center></h1>
<h2><center>Exploratory data analysis of Olympic games with Pandas</center></h2>

__There are ten questions about [120 years of Olympic history: athletes and results](https://www.kaggle.com/heesoo37/120-years-of-olympic-history-athletes-and-results/version/2) dataset in this task. Your task is to fill in the missing Python code and choose answers in [this web-form](https://docs.google.com/forms/d/179HYvlF_0x435CWdu2aOtR9a3flh0YCQXXNXhXaKw2M).__

Download the file `athlete_events.csv` from [Kaggle page](https://www.kaggle.com/heesoo37/120-years-of-olympic-history-athletes-and-results). The dataset has the following features (copied from Kaggle):

- __ID__ - Unique number for each athlete
- __Name__ - Athlete's name
- __Sex__ - M or F
- __Age__ - Integer
- __Height__ - In centimeters
- __Weight__ - In kilograms
- __Team__ - Team name
- __NOC__ - National Olympic Committee 3-letter code
- __Games__ - Year and season
- __Year__ - Integer
- __Season__ - Summer or Winter
- __City__ - Host city
- __Sport__ - Sport
- __Event__ - Event
- __Medal__ - Gold, Silver, Bronze, or NA

In [4]:
import pandas as pd

In [7]:
# Change the path to the dataset file if needed. 
PATH = '/home/mferrac/data/athlete/athlete_events.csv'

In [207]:
data = pd.read_csv(PATH)
data.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

__1. How old were the youngest male and female participants of the 1996 Olympics?__

- 16 and 15
- 14 and 12 
- 16 and 12
- 13 and 11

In [14]:
data[data['Year'] == 1996].groupby('Sex')['Age'].agg(['min','max'])

      min   max
Sex
F    12.0  58.0
M    14.0  63.0

__2. What was the percentage of male gymnasts among all the male participants of the 2000 Olympics? Round the answer to the first decimal.__

*Hint:* here and further if needed drop duplicated sportsmen to count only unique ones. 

- 0.2
- 1.5 
- 2.5
- 7.7

In [36]:
subq2 = data[(data['Year'] == 2000) & (data['Sport'] == 'Gymnastics')& (data['Sex'] == 'M')].drop_duplicates('Name')

In [37]:
subq2.shape[0]/data[data['Year'] == 2000].drop_duplicates('Name').Sex.value_counts()[0]

0.014752851711026615

__3. What are the mean and standard deviation of height for female basketball players participated in the 2000 Olympics? Round the answer to the first decimal.__

- 178.5 and 7.2
- 179.4 and 10
- 180.7 and 6.7
- 182.4 and 9.1

In [118]:
#subq3 = data.drop_duplicates('Name')
subq3 = subq3[(subq3['Year'] == 2000) &
              (data['Sex'] == 'F') &
              (subq3['Sport'] == 'Basketball')]
subq3.Height.agg(['mean','std'])

/home/mferrac/.local/lib/python3.6/site-packages/ipykernel_launcher.py:4: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  after removing the cwd from sys.path.

mean    181.903226
std       9.232580
Name: Height, dtype: float64

In [76]:
subq3.describe()

                  ID        Age      Height      Weight    Year
count      93.000000  93.000000   93.000000   93.000000    93.0
mean    66297.311828  25.344086  181.903226   73.526882  2000.0
std     38804.453469   3.789272    9.232580    9.191905     0.0
min       580.000000  17.000000  162.000000   58.000000  2000.0
25%     33910.000000  22.000000  175.000000   67.000000  2000.0
50%     67364.000000  26.000000  182.000000   73.000000  2000.0
75%     95540.000000  28.000000  188.000000   80.000000  2000.0
max    135105.000000  37.000000  213.000000  100.000000  2000.0

In [69]:
subq3.groupby('Sex').Height.agg(['mean','std'])

           mean       std
Sex
F    181.903226  9.232580
M    199.281818  9.145242

__4. Find a sportsperson participated in the 2002 Olympics, with the highest weight among other participants of the same Olympics. What sport did he or she do?__

- Judo
- Bobsleigh 
- Weightlifting
- Boxing

In [84]:
subq4 = data[data['Year'] == 2002][['Name','Weight','Sport']].drop_duplicates('Name')
subq4.sort_values('Weight', ascending=False).head()

                     Name  Weight       Sport
99154   Emmanuel Hostache   123.0   Bobsleigh
129595        Kevin Kuske   116.0   Bobsleigh
270556      Zsolt Zsombor   115.0   Bobsleigh
128125       Pavel Kubina   113.0  Ice Hockey
60488         Dalibor uri   113.0   Bobsleigh

__5. How many times did Pawe Abratkiewicz participate in the Olympics held in different years?__

- 0
- 1 
- 2
- 3

In [119]:
data[data["Name"] == "Pawe Abratkiewicz"].drop_duplicates('Year')

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
997,562,Pawe Abratkiewicz,M,21.0,183.0,84.0,Poland,POL,1992 Winter,1992,Winter,Albertville,Speed Skating,Speed Skating Men's 500 metres,NaN
999,562,Pawe Abratkiewicz,M,27.0,183.0,84.0,Poland,POL,1998 Winter,1998,Winter,Nagano,Speed Skating,Speed Skating Men's 500 metres,NaN
1001,562,Pawe Abratkiewicz,M,31.0,183.0,84.0,Poland,POL,2002 Winter,2002,Winter,Salt Lake City,Speed Skating,Speed Skating Men's 500 metres,NaN

__6. How many silver medals in tennis did Australia win at the 2000 Olympics?__

- 0
- 1 
- 2 
- 3

In [120]:
data[(data['Year'] == 2000)&(data.Team == "Australia") & (data.Sport == "Tennis")]['Medal'].value_counts()

Silver    2
Name: Medal, dtype: int64

__7. Is it true that Switzerland won fewer medals than Serbia at the 2016 Olympics? Do not consider NaN values in _Medal_ column.__ 

- Yes 
- No

In [170]:
subq7 = data[data['Year'] == 2016]
subq7 = subq7[[team in ['Switzerland','Serbia'] for team in subq7.Team]].assign(hasMedal = subq7.Medal.notna())
subq7.groupby('Team')['hasMedal'].agg('sum')

Team
Serbia         54.0
Switzerland    11.0
Name: hasMedal, dtype: float64

__8. What age category did the fewest and the most participants of the 2014 Olympics belong to?__
- [45-55] and [25-35) correspondingly
- [45-55] and [15-25) correspondingly
- [35-45] and [25-35) correspondingly
- [45-55] and [35-45) correspondingly

In [177]:
subq8 = data[data.Year == 2014]
pd.cut(subq8.Age,[0,14,25,35,44,55]).value_counts()

(14, 25]    2422
(25, 35]    2281
(35, 44]     183
(44, 55]       5
(0, 14]        0
Name: Age, dtype: int64

__9. Is it true that there were Summer Olympics held in Lake Placid? Is it true that there were Winter Olympics held in Sankt Moritz?__

- Yes, Yes
- Yes, No
- No, Yes 
- No, No

In [190]:
"Lake Placid" in data[data['Season'] == "Summer"].City.values

False

In [189]:
"Winter" in data[data['City'] == "Sankt Moritz"].Season.values

True

__10. What is the absolute difference between the number of unique sports at the 1995 Olympics and 2016 Olympics?__

- 16
- 24
- 26
- 34

In [201]:
len(data[data['Year'] == 2016]['Sport'].unique())

34

In [208]:
data.Year.unique()

array([1992, 2012, 1920, 1900, 1988, 1994, 1932, 2002, 1952, 1980, 2000,
       1996, 1912, 1924, 2014, 1948, 1998, 2006, 2008, 2016, 2004, 1960,
       1964, 1984, 1968, 1972, 1936, 1956, 1928, 1976, 2010, 1906, 1904,
       1908, 1896])